Конфигурация/Documents/СчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>СчетФактура</Name>
			<BasedOn>
				<xr:Item>Document.Оплата</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовФактур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактурыПолученного</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/УсловияСделокСНедвижимостью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УсловияСделокСНедвижимостью</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлановаяДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктПриемаПередачи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АктПриемаПередачиОбъектовНедвижимости</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводПрочихАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СведенияОГосРегистрацииПраваСобственности</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СведенияОРегистрацииПраваСобственности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНедвижимости</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/ЗадолженностиПоДенежнымСредствам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностиПоДенежнымСредствам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадолженностиПоДенежнымСредствам</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗадолженности</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аванс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ИФНСОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ИФНСОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИФНС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоКрупнейшимНалогоплательщикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПлатежейВБюджет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыНачисленоУплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоСамостоятельно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогВзносыДоначисленоУплаченоПоАктуПроверки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДвижений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/АктПриемаПередачиОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>АктПриемаПередачиОбъектовНедвижимости</Name>
			<BasedOn>
				<xr:Item>Document.СделкаСНедвижимостью</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияСделокСНедвижимостью</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностиПоДенежнымСредствам</xr:Item>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСНедвижимостью</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыНедвижимости</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимости</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНедвижимостиПоДДУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Documents/СчетФактура/Ext/ObjectModule.bsl
Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Движения[УчетныйРегистр].Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураОснования.Основание КАК Основание,
		|	СУММА(СчетФактураОснования.СуммаНДС) КАК СуммаНДС,
		|	СчетФактураОснования.Ссылка.Контрагент КАК Контрагент
		|ИЗ
		|	Документ.СчетФактура.Основания КАК СчетФактураОснования
		|ГДЕ
		|	СчетФактураОснования.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	СчетФактураОснования.Ссылка.Контрагент,
		|	СчетФактураОснования.Основание";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ЭтотОбъект.ТипСчетаФактуры = Перечисления.ТипыСчетовФактур.Выданный Тогда
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.СуммаНДС, "НДС по авансу");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Основной.НДСПоАвансамПолученным;
			
			Проводка.СубконтоДт.Контрагенты = ЭтотОбъект.Контрагент;
			Проводка.СубконтоДт.СчетаФактуры = ЭтотОбъект.Ссылка;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Основной.НДС;
			Проводка.СубконтоКт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
		Иначе
			
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], ВыборкаДетальныеЗаписи.СуммаНДС, "НДС по авансу");
			
			// дебет
			Проводка.СчетДт = ПланыСчетов.Основной.НДС;
			Проводка.СубконтоДт.ВидыПлатежейВБюджет = Перечисления.ВидыПлатежейВБюджет.НалогВзносыНачисленоУплачено;
			
			// кредит
			Проводка.СчетКт = ПланыСчетов.Основной.НДСПоАвансамВыданным;
			
			Проводка.СубконтоКт.Контрагенты = ЭтотОбъект.Контрагент;
			Проводка.СубконтоКт.СчетаФактуры = ЭтотОбъект.Ссылка;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	//проверим наличие аванса на момент документа
	//Для сделки с недвижимостью авансом будет оплата по сделке без признака аванса.
	//При проверке суммы аванса по недвижимости в секции "ГДЕ" проверяется не равенство, а превышение, т.к. авансов м.б. несколько
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураОснования.Основание КАК Основание,
		|	ЕСТЬNULL(СчетФактураОснования.СуммаСНДС, 0) КАК СуммаСНДССчетаФактуры,
		|	ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0) КАК СуммаОстатокПоДС,
		|	ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.Сумма, 0) КАК СуммаОстатокПоставкиНеджвижимости,
		|	ВЫБОР
		|		КОГДА ОплатаОснования.Ссылка ЕСТЬ NULL
		|			ТОГДА ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)
		|		ИНАЧЕ ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.Сумма, 0) - ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)
		|	КОНЕЦ КАК СуммаОстаток,
		|	СчетФактураОснования.Ссылка.Представление КАК Представление
		|ИЗ
		|	Документ.СчетФактура.Основания КАК СчетФактураОснования
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				УсловияСделокСНедвижимостьюСрезПоследних.Основание КАК Основание,
		|				СУММА(УсловияСделокСНедвижимостьюСрезПоследних.Сумма) КАК Сумма
		|			ИЗ
		|				РегистрСведений.УсловияСделокСНедвижимостью.СрезПоследних(
		|						&ДоДокумента,
		|						Организация = &Организация
		|							И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|			ГДЕ
		|				НЕ УсловияСделокСНедвижимостьюСрезПоследних.Отменено
		|				И УсловияСделокСНедвижимостьюСрезПоследних.АктПриемаПередачи = ЗНАЧЕНИЕ(Документ.АктПриемаПередачиОбъектовНедвижимости.ПустаяСсылка)
		|			
		|			СГРУППИРОВАТЬ ПО
		|				УсловияСделокСНедвижимостьюСрезПоследних.Основание) КАК УсловияСделокСНедвижимостьюСрезПоследних
		|			ПО ОплатаОснования.Основание = УсловияСделокСНедвижимостьюСрезПоследних.Основание
		|		ПО СчетФактураОснования.Основание = ОплатаОснования.Ссылка
		|			И (ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту)))
		|			И (НЕ УсловияСделокСНедвижимостьюСрезПоследних.Основание ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|				&ДоДокумента,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|					И (Аванс
		|							И Основание В
		|								(ВЫБРАТЬ
		|									СчетФактураОснования.Основание КАК Основание
		|								ИЗ
		|									Документ.СчетФактура.Основания КАК СчетФактураОснования
		|								ГДЕ
		|									СчетФактураОснования.Ссылка = &Ссылка)
		|						ИЛИ ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту))
		|							И Основание В
		|								(ВЫБРАТЬ
		|									ОплатаОснования.Основание КАК Основание
		|								ИЗ
		|									Документ.СчетФактура.Основания КАК СчетФактураОснования
		|										ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
		|										ПО
		|											СчетФактураОснования.Основание = ОплатаОснования.Ссылка
		|												И ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту))
		|												И СчетФактураОснования.Ссылка = &Ссылка))) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|		ПО (СчетФактураОснования.Основание = ЗадолженностиПоДенежнымСредствамОстатки.Основание
		|				ИЛИ ОплатаОснования.Основание = ЗадолженностиПоДенежнымСредствамОстатки.Основание)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА ОплатаОснования.Ссылка ЕСТЬ NULL
		|				ТОГДА ЕСТЬNULL(СчетФактураОснования.СуммаСНДС, 0) <> ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)
		|			ИНАЧЕ ЕСТЬNULL(СчетФактураОснования.СуммаСНДС, 0) > ЕСТЬNULL(УсловияСделокСНедвижимостьюСрезПоследних.Сумма, 0) - ЕСТЬNULL(ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток, 0)
		|		КОНЕЦ
		|	И СчетФактураОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ДоДокумента", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Остаток суммы аванса " + Формат(ВыборкаДетальныеЗаписи.СуммаОстаток, "ЧДЦ=2; ЧН=0")
			+ " по основанию " + ВыборкаДетальныеЗаписи.Представление
			+ " на момент оформления счета-фактуры не соответствует документу", ЭтотОбъект.Ссылка,,, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Движения.ЗадолженностиПоДенежнымСредствам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетФактураОснования.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	СчетФактураОснования.Ссылка КАК Основание,
		|	СчетФактураОснования.Ссылка.Организация КАК Организация,
		|	СчетФактураОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА СчетФактураОснования.Ссылка.ТипСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Выданный)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|	КОНЕЦ КАК ТипЗадолженности,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСПоАвансам) КАК ВидЗадолженности,
		|	СчетФактураОснования.СуммаНДС КАК Сумма,
		|	&ИФНС КАК Контрагент,
		|	&ВалютаРубли КАК Валюта
		|ИЗ
		|	Документ.СчетФактура.Основания КАК СчетФактураОснования
		|ГДЕ
		|	СчетФактураОснования.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СчетФактураОснования.Ссылка.Дата,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	СчетФактураОснования.Ссылка,
		|	СчетФактураОснования.Ссылка.Организация,
		|	СчетФактураОснования.Ссылка.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА СчетФактураОснования.Ссылка.ТипСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Выданный)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|	КОНЕЦ,
		|	ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.НДСТекущегоПериода),
		|	СчетФактураОснования.СуммаНДС,
		|	&ИФНС,
		|	&ВалютаРубли
		|ИЗ
		|	Документ.СчетФактура.Основания КАК СчетФактураОснования
		|ГДЕ
		|	СчетФактураОснования.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВалютаРубли", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	Запрос.УстановитьПараметр("ИФНС", РегистрыСведений.ИФНСОрганизаций.ПолучитьИФНС(ЭтотОбъект.Дата, ЭтотОбъект.Организация, Истина));
	
	Движения.ЗадолженностиПоДенежнымСредствам.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#Область ОБРАБОТЧИКИ_СОБЫТИЙ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Оплата") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ОплатаОснования.Ссылка КАК Ссылка,
			|	ОплатаОснования.Ссылка.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
			|	ОплатаОснования.Ссылка.ВидДвижения КАК ВидДвижения,
			|	ВЫБОР
			|		КОГДА ОплатаОснования.Ссылка.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
			|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Выданный)
			|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыСчетовФактур.Полученный)
			|	КОНЕЦ КАК ТипСчетаФактуры,
			|	ОплатаОснования.Ссылка.Аванс КАК Аванс,
			|	ОплатаОснования.Основание КАК Основание,
			|	ОплатаОснования.Ссылка.Контрагент КАК Контрагент,
			|	ОплатаОснования.Ссылка.Договор КАК Договор,
			|	ОплатаОснования.Сумма КАК Сумма,
			|	ОплатаОснования.Валюта КАК Валюта,
			|	ОплатаОснования.СтавкаНДС КАК СтавкаНДС,
			|	ОплатаОснования.СуммаНДС КАК СуммаНДС
			|ИЗ
			|	Документ.Оплата.Основания КАК ОплатаОснования
			|ГДЕ
			|	ОплатаОснования.Ссылка = &Ссылка
			|	И (ОплатаОснования.Ссылка.Аванс
			|			ИЛИ ОплатаОснования.Ссылка.ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоИнвестконтракту)))";

		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);

		РезультатЗапроса = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(ЭтотОбъект.СчетДоверительногоУправления) Тогда 
				//первая строка
				ЭтотОбъект.СчетДоверительногоУправления = ВыборкаДетальныеЗаписи.СчетДоверительногоУправления;
				ЭтотОбъект.ТипСчетаФактуры = ВыборкаДетальныеЗаписи.ТипСчетаФактуры;
				ЭтотОбъект.Контрагент = ВыборкаДетальныеЗаписи.Контрагент;
				ЭтотОбъект.Договор = ВыборкаДетальныеЗаписи.Договор;
			КонецЕсли;
			
			СтрокаОснования = ЭтотОбъект.Основания.Добавить();
			СтрокаОснования.Основание = ДанныеЗаполнения;
			СтрокаОснования.СуммаСНДС = ВыборкаДетальныеЗаписи.Сумма;
			СтрокаОснования.СтавкаНДС = ВыборкаДетальныеЗаписи.СтавкаНДС;
			СтрокаОснования.СуммаНДС = ВыборкаДетальныеЗаписи.СуммаНДС;
			
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);

	ОбщегоНазначенияКлиентСервер.ОчиститьПоля(ЭтотОбъект,
		"НомерСчетаФактуры, ДатаСчетаФактурыПолученного");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);
	
	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		Если ЭтотОбъект.Основания.Итог("СуммаНДС") = 0 Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма НДС документа = 0!", ЭтотОбъект.Ссылка, ,, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЭтотОбъект.НомерСчетаФактуры) Тогда
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен номера счета-фактуры!", ЭтотОбъект.Ссылка, "НомерСчетаФактуры",, Отказ);
		ИначеЕсли ЭтотОбъект.ТипСчетаФактуры = Перечисления.ТипыСчетовФактур.Выданный 
			И Не РаботаСНДС.НомерСчетаФактурыУникален(ЭтотОбъект.Ссылка, ЭтотОбъект.НомерСчетаФактуры, ЭтотОбъект.Дата, ЭтотОбъект.СчетДоверительногоУправления, ЭтотОбъект.Организация) Тогда
		    Отказ = Истина;
		КонецЕсли;
		
		//проверим основание и сумму (не более, чем в оплате)
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	СчетФактураОснования.Основание КАК Основание,
			|	СчетФактураОснования.СуммаСНДС КАК СуммаСНДС,
			|	ВложенныйЗапрос.Сумма КАК Сумма,
			|	ВложенныйЗапрос.Аванс КАК Аванс,
			|	ВложенныйЗапрос.ВидЗадолженности КАК ВидЗадолженности,
			|	СчетФактураОснования.НомерСтроки КАК НомерСтроки,
			|	СчетФактураОснования.Основание.Представление КАК ОснованиеПредставление,
			|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС
			|ИЗ
			|	Документ.СчетФактура.Основания КАК СчетФактураОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			|			ОплатаОснования.Ссылка.ВидЗадолженности КАК ВидЗадолженности,
			|			ОплатаОснования.Ссылка.Аванс КАК Аванс,
			|			СУММА(ОплатаОснования.Сумма) КАК Сумма,
			|			ОплатаОснования.Ссылка КАК Ссылка,
			|			СУММА(ОплатаОснования.СуммаНДС) КАК СуммаНДС
			|		ИЗ
			|			Документ.СчетФактура.Основания КАК СчетФактураОснования
			|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата.Основания КАК ОплатаОснования
			|				ПО СчетФактураОснования.Основание = ОплатаОснования.Ссылка
			|		ГДЕ
			|			СчетФактураОснования.Ссылка = &Ссылка
			|			И НЕ(ОплатаОснования.Ссылка.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоСделкеСНедвижимостью)
			|						ИЛИ ОплатаОснования.Ссылка.Аванс)
			|		
			|		СГРУППИРОВАТЬ ПО
			|			ОплатаОснования.Ссылка.ВидЗадолженности,
			|			ОплатаОснования.Ссылка.Аванс,
			|			ОплатаОснования.Ссылка) КАК ВложенныйЗапрос
			|		ПО СчетФактураОснования.Основание = ВложенныйЗапрос.Ссылка
			|			И (СчетФактураОснования.Ссылка = &Ссылка)
			|			И (ВложенныйЗапрос.Сумма < СчетФактураОснования.СуммаСНДС
			|				ИЛИ ВложенныйЗапрос.СуммаНДС = 0)
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если Не (ВыборкаДетальныеЗаписи.Аванс 
				ИЛИ ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоСделкеСНедвижимостью
				ИЛИ ВыборкаДетальныеЗаписи.ВидЗадолженности = Справочники.ВидыЗадолженности.ПоИнвестконтракту) Тогда
				    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В основании можно указывать только авансы!", ЭтотОбъект.Ссылка, "Основания[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Основание",, Отказ);
				КонецЕсли;
				Если (ВыборкаДетальныеЗаписи.СуммаНДС = 0) Тогда
				    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + ВыборкаДетальныеЗаписи.НомерСтроки 
						+ " сумма НДС в документе-основании " + ВыборкаДетальныеЗаписи.ОснованиеПредставление + " нулевая!", 
						ЭтотОбъект.Ссылка, "Основания[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Основание",, Отказ);
				ИначеЕсли (ВыборкаДетальныеЗаписи.Сумма < ВыборкаДетальныеЗаписи.СуммаСНДС)Тогда
				    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + ВыборкаДетальныеЗаписи.НомерСтроки 
						+ " сумма основания " + ВыборкаДетальныеЗаписи.ОснованиеПредставление + " меньше суммы счета-фактуры!", 
						ЭтотОбъект.Ссылка, "Основания[" + (ВыборкаДетальныеЗаписи.НомерСтроки - 1) + "].Основание",, Отказ);
				КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПриЗаписи

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
